What you need:
`./data/uk_population.json` (output of the last section **2-numpy**)

### Load NumPy and Pandas

In [1]:
import numpy as np
import pandas as pd

### Series (1-dimensional)

In [2]:
# Create a series
pd.Series([8, 9, 10])

# You can see that the indices are also displayed. Distinguish from NumPy array which only has values but not indices
# Think about NumPy array and pandas series with Python native list and dict

0     8
1     9
2    10
dtype: int64

In [3]:
# Specify your own indices
t = pd.Series([8, 9, 10, 11, 13], index=['a', 'b', 'c', 'd', 'e'])
t

a     8
b     9
c    10
d    11
e    13
dtype: int64

In [4]:
# Access an element by its index (similar to Python native dict)
t['c']

np.int64(10)

In [5]:
# Modify an element
t['d'] = 110
t

a      8
b      9
c     10
d    110
e     13
dtype: int64

In [6]:
# The element will be added if the index does not exist
t['f'] = 0
t

a      8
b      9
c     10
d    110
e     13
f      0
dtype: int64

In [7]:
# To access multiple elements, provide a list of indices (so that there are two pairs of brackets)
t[['d', 'c', 'f']]

d    110
c     10
f      0
dtype: int64

In [8]:
# Element-wise operation ('broadcasting')
t * 2

a     16
b     18
c     20
d    220
e     26
f      0
dtype: int64

In [9]:
# To convert a sequence of temperature from Celsus to Fahrenheit
# F = C * 9 / 5 + 32
t * 9 / 5 + 32

a     46.4
b     48.2
c     50.0
d    230.0
e     55.4
f     32.0
dtype: float64

In [10]:
# Note that 't' itself hasn't changed following the arithmetic operations
t

a      8
b      9
c     10
d    110
e     13
f      0
dtype: int64

In [11]:
# Filter by condition
# Similarly to the conditional filtering of NumPy array, we also get a sequence of boolean here, but this time with indices
t < 11

a     True
b     True
c     True
d    False
e    False
f     True
dtype: bool

In [12]:
# To filter out the elements, provide the sequence of boolean
t[t < 11]

a     8
b     9
c    10
f     0
dtype: int64

In [13]:
# Conditional filtering also works on expressions, not just simple variable names
(t * 9 / 5 + 32) <= 50

a     True
b     True
c     True
d    False
e    False
f     True
dtype: bool

In [14]:
t[(t * 9 / 5 + 32) <= 50]

a     8
b     9
c    10
f     0
dtype: int64

In [15]:
# Note that 't' itself hasn't changed following the conditional filtering
t

a      8
b      9
c     10
d    110
e     13
f      0
dtype: int64

In [16]:
# Operations involving multiple series
t2 = pd.Series([10, 11, 13, 14, 15, 17])
t2 - t

# Why it says NaN (Not a Number)?

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
f   NaN
dtype: float64

In [17]:
# Both series should have at least some overlapping indices in this case
t3 = pd.Series([13, 15, 17, 99], index=['c', 'a', 'e', 'g'])
t3 - t

# Now elements with the same index across two series will be included in the calculation, otherwise they will end up with NaN

a    7.0
b    NaN
c    3.0
d    NaN
e    4.0
f    NaN
g    NaN
dtype: float64

### DataFrame (usually 2-dimensional or higher)

In [18]:
import json

with open('./data/uk_population.json', 'r') as f:
    population = json.load(f)

population

{'country': ['England',
  'England',
  'England',
  'England',
  'Northern Ireland',
  'Northern Ireland',
  'Northern Ireland',
  'Northern Ireland',
  'Scotland',
  'Scotland',
  'Scotland',
  'Scotland',
  'Wales',
  'Wales',
  'Wales',
  'Wales'],
 'year': ['1991',
  '2001',
  '2011',
  '2021',
  '1991',
  '2001',
  '2011',
  '2021',
  '1991',
  '2001',
  '2011',
  '2021',
  '1991',
  '2001',
  '2011',
  '2021'],
 'population': ['47055205',
  '49138831',
  '53012456',
  '56490048',
  '1577836',
  '1685267',
  '1810863',
  '1903175',
  '4998567',
  '5062011',
  '5295403',
  '5418400',
  '2835073',
  '2903085',
  '3063456',
  '3107494']}

In [19]:
df = pd.DataFrame(population)
print(type(df))
df

# Now the DataFrame is nicely displayed in the notebook

<class 'pandas.core.frame.DataFrame'>

             country  year population
0            England  1991   47055205
1            England  2001   49138831
2            England  2011   53012456
3            England  2021   56490048
4   Northern Ireland  1991    1577836
5   Northern Ireland  2001    1685267
6   Northern Ireland  2011    1810863
7   Northern Ireland  2021    1903175
8           Scotland  1991    4998567
9           Scotland  2001    5062011
10          Scotland  2011    5295403
11          Scotland  2021    5418400
12             Wales  1991    2835073
13             Wales  2001    2903085
14             Wales  2011    3063456
15             Wales  2021    3107494

In [20]:
# List all columns of the DataFrame
df.columns

Index(['country', 'year', 'population'], dtype='object')

In [21]:
# List all indices of the DataFrame
df.index

RangeIndex(start=0, stop=16, step=1)

In [22]:
# If the table is too long you can get the first few rows (omit '3' here and it will return the first 5 rows by default)
df.head(3)

   country  year population
0  England  1991   47055205
1  England  2001   49138831
2  England  2011   53012456

In [23]:
# Get the last few rows
df.tail(8)

     country  year population
8   Scotland  1991    4998567
9   Scotland  2001    5062011
10  Scotland  2011    5295403
11  Scotland  2021    5418400
12     Wales  1991    2835073
13     Wales  2001    2903085
14     Wales  2011    3063456
15     Wales  2021    3107494

In [24]:
# Get a specific column
df['population']

0     47055205
1     49138831
2     53012456
3     56490048
4      1577836
5      1685267
6      1810863
7      1903175
8      4998567
9      5062011
10     5295403
11     5418400
12     2835073
13     2903085
14     3063456
15     3107494
Name: population, dtype: object

In [25]:
# Re-organise the columns - provide a list of columns, which will overwrite all the existing columns
pd.DataFrame(df, columns=['year', 'country', 'population'])

    year           country population
0   1991           England   47055205
1   2001           England   49138831
2   2011           England   53012456
3   2021           England   56490048
4   1991  Northern Ireland    1577836
5   2001  Northern Ireland    1685267
6   2011  Northern Ireland    1810863
7   2021  Northern Ireland    1903175
8   1991          Scotland    4998567
9   2001          Scotland    5062011
10  2011          Scotland    5295403
11  2021          Scotland    5418400
12  1991             Wales    2835073
13  2001             Wales    2903085
14  2011             Wales    3063456
15  2021             Wales    3107494

In [26]:
# Provide new columns e.g. 'area' and all the values will be populated with NaN
pd.DataFrame(df, columns=['year', 'country', 'area'])

# Note that this returns a new Dataframe so our original df is left intact

    year           country  area
0   1991           England   NaN
1   2001           England   NaN
2   2011           England   NaN
3   2021           England   NaN
4   1991  Northern Ireland   NaN
5   2001  Northern Ireland   NaN
6   2011  Northern Ireland   NaN
7   2021  Northern Ireland   NaN
8   1991          Scotland   NaN
9   2001          Scotland   NaN
10  2011          Scotland   NaN
11  2021          Scotland   NaN
12  1991             Wales   NaN
13  2001             Wales   NaN
14  2011             Wales   NaN
15  2021             Wales   NaN

### Sorting data & statistics

In [27]:
# First we need to check the data types of columns

df.dtypes
# It says 'object', which actually means (text) 'string' in this case
# This may result in unexpected outcome as numbers can be sorted lexicographically
# We need to force convert those columns to numbers first

country       object
year          object
population    object
dtype: object

In [28]:
df['year'] = pd.to_numeric(df['year'])
df['population'] = pd.to_numeric(df['population'])
df.dtypes

# Now the 'year' and 'population' will say 'int64' which means integer

country       object
year           int64
population     int64
dtype: object

In [29]:
# Sort by 'year' and then 'population', in decending order
df.sort_values(['year', 'population'], ascending=False)

             country  year  population
3            England  2021    56490048
11          Scotland  2021     5418400
15             Wales  2021     3107494
7   Northern Ireland  2021     1903175
2            England  2011    53012456
10          Scotland  2011     5295403
14             Wales  2011     3063456
6   Northern Ireland  2011     1810863
1            England  2001    49138831
9           Scotland  2001     5062011
13             Wales  2001     2903085
5   Northern Ireland  2001     1685267
0            England  1991    47055205
8           Scotland  1991     4998567
12             Wales  1991     2835073
4   Northern Ireland  1991     1577836

In [30]:
# Check the pivot table
df.pivot_table(values='population', index=['country', 'year'])

                       population
country          year
England          1991  47055205.0
                 2001  49138831.0
                 2011  53012456.0
                 2021  56490048.0
Northern Ireland 1991   1577836.0
                 2001   1685267.0
                 2011   1810863.0
                 2021   1903175.0
Scotland         1991   4998567.0
                 2001   5062011.0
                 2011   5295403.0
                 2021   5418400.0
Wales            1991   2835073.0
                 2001   2903085.0
                 2011   3063456.0
                 2021   3107494.0

In [31]:
# Calculate the mean of population by country
df.groupby(['country'])['population'].mean()

country
England             51424135.00
Northern Ireland     1744285.25
Scotland             5193595.25
Wales                2977277.00
Name: population, dtype: float64

In [32]:
# You can also chain the actions
df.groupby(['country'])['population'].mean().sort_values(ascending=True)

country
Northern Ireland     1744285.25
Wales                2977277.00
Scotland             5193595.25
England             51424135.00
Name: population, dtype: float64

### Missing values

In [33]:
# Missing values are quite common in your daily work
# Here we create a duplicate DataFrame but with some missing values
df2 = df.copy()
df2.loc[[5, 9, 13], ['population']] = np.nan

df2

             country  year  population
0            England  1991  47055205.0
1            England  2001  49138831.0
2            England  2011  53012456.0
3            England  2021  56490048.0
4   Northern Ireland  1991   1577836.0
5   Northern Ireland  2001         NaN
6   Northern Ireland  2011   1810863.0
7   Northern Ireland  2021   1903175.0
8           Scotland  1991   4998567.0
9           Scotland  2001         NaN
10          Scotland  2011   5295403.0
11          Scotland  2021   5418400.0
12             Wales  1991   2835073.0
13             Wales  2001         NaN
14             Wales  2011   3063456.0
15             Wales  2021   3107494.0

In [34]:
# One method is to interpolate
df2.interpolate()

# Check their docs to see the rationale behind interpolate()
# https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.interpolate.html

/var/folders/95/q416n7fx77l3yfckm3670b740000gq/T/ipykernel_1853/215358841.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df2.interpolate()

             country  year  population
0            England  1991  47055205.0
1            England  2001  49138831.0
2            England  2011  53012456.0
3            England  2021  56490048.0
4   Northern Ireland  1991   1577836.0
5   Northern Ireland  2001   1694349.5
6   Northern Ireland  2011   1810863.0
7   Northern Ireland  2021   1903175.0
8           Scotland  1991   4998567.0
9           Scotland  2001   5146985.0
10          Scotland  2011   5295403.0
11          Scotland  2021   5418400.0
12             Wales  1991   2835073.0
13             Wales  2001   2949264.5
14             Wales  2011   3063456.0
15             Wales  2021   3107494.0

In [35]:
# Or just fill them with 0 (or any other value specified)
df2.fillna(0)

             country  year  population
0            England  1991  47055205.0
1            England  2001  49138831.0
2            England  2011  53012456.0
3            England  2021  56490048.0
4   Northern Ireland  1991   1577836.0
5   Northern Ireland  2001         0.0
6   Northern Ireland  2011   1810863.0
7   Northern Ireland  2021   1903175.0
8           Scotland  1991   4998567.0
9           Scotland  2001         0.0
10          Scotland  2011   5295403.0
11          Scotland  2021   5418400.0
12             Wales  1991   2835073.0
13             Wales  2001         0.0
14             Wales  2011   3063456.0
15             Wales  2021   3107494.0

In [36]:
# Or just drop those rows
df2.dropna(subset=['population'])

             country  year  population
0            England  1991  47055205.0
1            England  2001  49138831.0
2            England  2011  53012456.0
3            England  2021  56490048.0
4   Northern Ireland  1991   1577836.0
6   Northern Ireland  2011   1810863.0
7   Northern Ireland  2021   1903175.0
8           Scotland  1991   4998567.0
10          Scotland  2011   5295403.0
11          Scotland  2021   5418400.0
12             Wales  1991   2835073.0
14             Wales  2011   3063456.0
15             Wales  2021   3107494.0

### Accessing and modifying elements

In [37]:
# Confirm that the original DataFrame is intact
df

             country  year  population
0            England  1991    47055205
1            England  2001    49138831
2            England  2011    53012456
3            England  2021    56490048
4   Northern Ireland  1991     1577836
5   Northern Ireland  2001     1685267
6   Northern Ireland  2011     1810863
7   Northern Ireland  2021     1903175
8           Scotland  1991     4998567
9           Scotland  2001     5062011
10          Scotland  2011     5295403
11          Scotland  2021     5418400
12             Wales  1991     2835073
13             Wales  2001     2903085
14             Wales  2011     3063456
15             Wales  2021     3107494

In [38]:
# Access an element by integer index (won't work if the index of the DataFrame is not an integer)
# i means int
df.iloc[10]

country       Scotland
year              2011
population     5295403
Name: 10, dtype: object

In [39]:
# Slicing also works
df.iloc[4:7]

            country  year  population
4  Northern Ireland  1991     1577836
5  Northern Ireland  2001     1685267
6  Northern Ireland  2011     1810863

In [40]:
# Conditional filtering
df[df['country'] == 'Wales']

   country  year  population
12   Wales  1991     2835073
13   Wales  2001     2903085
14   Wales  2011     3063456
15   Wales  2021     3107494

In [41]:
# Compound conditions also work - use the '&' or '|' symbols to denote AND or OR, and use parenthesis to avoid ambiguity (order of operations)
df3 = df[(df['year'] == 2001) & (df['population'] > 3_000_000)]
df3

    country  year  population
1   England  2001    49138831
9  Scotland  2001     5062011

In [42]:
# To reset the indices of the new DataFrame
df3.reset_index(drop=True)

    country  year  population
0   England  2001    49138831
1  Scotland  2001     5062011

In [43]:
# More conditional filtering
df[df['country'].str.contains('land')]

             country  year  population
0            England  1991    47055205
1            England  2001    49138831
2            England  2011    53012456
3            England  2021    56490048
4   Northern Ireland  1991     1577836
5   Northern Ireland  2001     1685267
6   Northern Ireland  2011     1810863
7   Northern Ireland  2021     1903175
8           Scotland  1991     4998567
9           Scotland  2001     5062011
10          Scotland  2011     5295403
11          Scotland  2021     5418400

In [44]:
df[df['country'].str.endswith('land')]

             country  year  population
0            England  1991    47055205
1            England  2001    49138831
2            England  2011    53012456
3            England  2021    56490048
4   Northern Ireland  1991     1577836
5   Northern Ireland  2001     1685267
6   Northern Ireland  2011     1810863
7   Northern Ireland  2021     1903175
8           Scotland  1991     4998567
9           Scotland  2001     5062011
10          Scotland  2011     5295403
11          Scotland  2021     5418400

In [45]:
# '~' denotes NOT
df[~df['country'].str.contains('land')]

   country  year  population
12   Wales  1991     2835073
13   Wales  2001     2903085
14   Wales  2011     3063456
15   Wales  2021     3107494

In [46]:
# To call a function on each row of the DataFrame
for index, row in df.iterrows():
    print("The population of", row['country'], "in", row['year'], "is", row['population']) # Do something

The population of England in 1991 is 47055205
The population of England in 2001 is 49138831
The population of England in 2011 is 53012456
The population of England in 2021 is 56490048
The population of Northern Ireland in 1991 is 1577836
The population of Northern Ireland in 2001 is 1685267
The population of Northern Ireland in 2011 is 1810863
The population of Northern Ireland in 2021 is 1903175
The population of Scotland in 1991 is 4998567
The population of Scotland in 2001 is 5062011
The population of Scotland in 2011 is 5295403
The population of Scotland in 2021 is 5418400
The population of Wales in 1991 is 2835073
The population of Wales in 2001 is 2903085
The population of Wales in 2011 is 3063456
The population of Wales in 2021 is 3107494

In [47]:
# Modify values based on conditions

# Criminal procedure in Scotland generally requires 15 jurors in the jury since 16th century (https://www.gov.scot/publications/not-proven-verdict-related-reforms-consultation/pages/4/)
df['jury'] = [12 if is_not_scotland else 15 for is_not_scotland in df['country'] != 'Scotland']
df

             country  year  population  jury
0            England  1991    47055205    12
1            England  2001    49138831    12
2            England  2011    53012456    12
3            England  2021    56490048    12
4   Northern Ireland  1991     1577836    12
5   Northern Ireland  2001     1685267    12
6   Northern Ireland  2011     1810863    12
7   Northern Ireland  2021     1903175    12
8           Scotland  1991     4998567    15
9           Scotland  2001     5062011    15
10          Scotland  2011     5295403    15
11          Scotland  2021     5418400    15
12             Wales  1991     2835073    12
13             Wales  2001     2903085    12
14             Wales  2011     3063456    12
15             Wales  2021     3107494    12

#### Is this (DataFrame with the `jury` column) a good database design?

Probably no, because the `jury` column is dependant on the 'country' column, i.e. once you know which country you are looking at, you can 'figure out' the size of jury. You don't need to store those duplicate values. Maybe use a separate table/DataFrame with 'country' and 'jury' as the only columns and each country is a row.

In [48]:
# Delete the column
del df['jury']

### Saving data to files

In [49]:
# Output to CSV
df.to_csv('./data/output_uk_population_by_rows.csv', index=False)

In [50]:
# Output to TSV
df.to_csv('./data/output_uk_population_by_rows.tsv', index=False, sep="\t")

In [51]:
# Output to Excel
df.to_excel('./data/output_uk_population_by_rows.xlsx', index=False)